Edmond-Sung-Tymphany/Hendrix_M_Lite_GD/sw/project_files/Atmos_SZ/stm32/attachedDevices.c
/**
* @file attachedDevices.c
* @brief The devices attached to the product.
* @author Christopher Alexander, Wesley Lee
* @date 26-Nov-2013
* @copyright Tymphany Ltd.
*/

#include "stm32f0xx_usart.h"
#include "deviceTypes.h"
#include "attachedDevices.h"
#include "trace.h"
#include "product.config"
#ifdef HAS_INFRARED_KEY
#include "IR.config"
#endif

/****************************************
 * Device: Keys                         *
 ****************************************/
static const tGPIOPin gpioKeyPins[] =
{
    {GPIO_IN_STB_SW,        IO_PORT_C,  IO_BIT_13,  GPIO_DIGITAL_INPUT,  GPIO_ACTIVE_HIGH,  ODC_NOT_APPLICABLE}, // Power key, PC13
};
static const tGPIODevice GPIOKeyConfig =
{
  .usedGPIOPinNum =  ArraySize(gpioKeyPins),
  .pGPIOPinSet = gpioKeyPins
};

/**
 * keyboard object setting
 */
static const tGpioKey gpioKeysSet[] =
{   /* key_id           */
    {STANDBY_KEY,          GPIO_IN_STB_SW},
};

static tGpioKeyboardDevice gpioKeyConfig =
{
    .gpioKeyboard.deviceInfo.deviceID = KEYBOARD_DEV_ID,
    .gpioKeyboard.deviceInfo.deviceType = GPIO_DEV_TYPE,
    .gpioKeyboard.keyNum = NUM_OF_GPIO_KEY, // == ArraySize(gpioKeysSet)
    .attachedDeviceObjConfig = &GPIOKeyConfig,
    .pGpioKeySet = gpioKeysSet
};

/**
 * keyboard object setting
 * The ADC threshold defind in our document is not correct(theoretical value),
 * It has too large difference with the real value. Below is the theoretical
 * adc threshold table and the real threshold  table
 * Theoretical threshold table (defined in our project specification):
        key_id       key_ADC_channel   adc_max_value  adc_max_value
        {VOLUME_DOWN_KEY,   ADC_CHANNEL0,   {(512-15),  (512+15)}},
        {VOLUME_UP_KEY,     ADC_CHANNEL0,   {(410-13),  (410+13)}},
        {VOL_UP_DOWN_KEY,   ADC_CHANNEL0,   {(640-18),  (640+18)}},
        {NEXT_PREV_KEY,     ADC_CHANNEL1,   {(600-17),  (600+17)}},
        {NEXT_KEY,          ADC_CHANNEL1,   {(300-10),  (300+10)}},
        {PLAY_PAUSE_KEY,    ADC_CHANNEL1,   {(410-13),  (408+13)}},
        {PREV_KEY,          ADC_CHANNEL1,   {(512-15),  (512+15)}}
 * The real threshold table is based on Ruben's idea, the adc range is enlarged
 * to handle specail case such as hardware bugs. Aparrently, the range is
 * continuous, this enables the software to, at least, "do something" if there
 * is hardware defeat which lead to an uncommon adc value. It is difficult
 * to detect the bug if the software just igonore this uncommon adc value.
 */

/* #6 board volume up key = 2777 */
#define ADC_THRESHOLD_LEVEL_3   2500
#define ADC_THRESHOLD_LEVEL_4   3000

/* #6 board BT key = 2143 */
#define ADC_THRESHOLD_LEVEL_5   2000
#define ADC_THRESHOLD_LEVEL_6   2300

#define ADC_THRESHOLD_RANGE_3_4   ADC_THRESHOLD_LEVEL_3,ADC_THRESHOLD_LEVEL_4
#define ADC_THRESHOLD_RANGE_5_6   ADC_THRESHOLD_LEVEL_5,ADC_THRESHOLD_LEVEL_6

static const tAdcPinIoAttr adcKeyPins[] =
{
    {ADC_KEY_BUTTON0,    ADC_CHANNEL10,  IO_PORT_C, IO_BIT_0},  // adc key 0
    {ADC_KEY_BUTTON1,    ADC_CHANNEL11,  IO_PORT_C, IO_BIT_1},  // adc key 1
};

static const tADCDevice adcKeyConfig =
{
//    .deviceInfo.deviceID    = KEYBOARD_DEV_ID,
//    .deviceInfo.deviceType  = ADC_DEV_TYPE,
    .ADCEnabledPinNum = ArraySize(adcKeyPins),
    .pAdcPinIoAttr = adcKeyPins
};

static const tAdcKey adcKeys[]=
{   /* key_id           key_ADC_channel   adc threshold */
    {VOLUME_UP_KEY,     ADC_PIN10,   ADC_THRESHOLD_RANGE_3_4},
    {BT_KEY,            ADC_PIN10,   ADC_THRESHOLD_RANGE_5_6},
    {VOLUME_DOWN_KEY,   ADC_PIN11,   ADC_THRESHOLD_RANGE_3_4},
    {SOURCE_SWITCH_IR_KEY,  ADC_PIN11,   ADC_THRESHOLD_RANGE_5_6},    
};

static tAdcKeyboardDevice adcKeyboardConfig =
{
    .adcKeyboard.deviceInfo.deviceID = KEYBOARD_DEV_ID,
    .adcKeyboard.deviceInfo.deviceType = ADC_DEV_TYPE,
    .adcKeyboard.keyNum = ArraySize(adcKeys),
    .attachedDeviceObjConfig = &adcKeyConfig,
    .pAdcKeySet = adcKeys
};

#ifdef HAS_INFRARED_KEY
/* IR key configuration */
#define POWER_IR_CODE          0X020240BF
#define VOL_DOWN_IR_CODE       0x020220DF
#define VOL_UP_IR_CODE         0x0202609F
#define PREV_IR_CODE           0x0202906F
#define NEXT_IR_CODE           0x0202B04F
#define ENTER_IR_CODE          0x0202708F
#define BACK_IR_CODE           0x020230CF
#define MUTE_IR_CODE           0X0202906F
#define PRESET1_IR_CODE        0x020228D7
#define PRESET2_IR_CODE        0x0202A857
#define PRESET3_IR_CODE        0x02026897
#define BRIGHTNESS_BTN_IR_CODE 0x02028877

static tIrKeyIdMapCode keyIdIrCodeMap[NUM_OF_IR_KEY] = 
{
    {SCREEN_OFF_ON_KEY,     BRIGHTNESS_BTN_IR_CODE},
    {IR_VOLUME_UP_KEY,      VOL_UP_IR_CODE},
    {IR_VOLUME_DOWN_KEY,    VOL_DOWN_IR_CODE},
    {PREV_KEY,              PREV_IR_CODE},
    {NEXT_KEY,              NEXT_IR_CODE},
    {ENTER_KEY,             ENTER_IR_CODE},
    {RETURN_KEY,            BACK_IR_CODE},
    {IR_PRESET_KEY_1,       PRESET1_IR_CODE},
    {IR_PRESET_KEY_2,       PRESET2_IR_CODE},
    {IR_PRESET_KEY_3,       PRESET3_IR_CODE},
    {MUTE_KEY,              MUTE_IR_CODE},
};

static tIRKeyboardDevice IrKeyBoardConfig =
{
    .irKeyboard.deviceInfo.deviceID = KEYBOARD_DEV_ID,
    .irKeyboard.deviceInfo.deviceType = INFRARED_DEV_TYPE,
    .irKeyboard.keyNum = NUM_OF_IR_KEY,
    .keyIdIrCodeMap = keyIdIrCodeMap,
    .ioAttr = 
      {
        GPIO_OUT_IR_RX,
        IO_PORT_B,
        IO_BIT_3,
        GPIO_DIGITAL_INPUT,
        GPIO_ACTIVE_LOW,
        ODC_DISABLE
      }
};
#endif

#ifdef PT_I2C_DEBUG
static const tI2CDevice i2cDbgConfig1 =
{
    .deviceInfo.deviceID = DBG_I2C1_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_ONE, //I2C2
    .pvSlaveCallback = NULL,  //not-used parameter
    .regAddrLen = REG_LEN_16BITS,
    .baudRate = 400, //KHz
};
static const tI2CDevice i2cDbgConfig2 =
{
    .deviceInfo.deviceID = DBG_I2C2_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_TWO, //I2C2
    .pvSlaveCallback = NULL,  //not-used parameter
    .regAddrLen = REG_LEN_16BITS,
    .baudRate = 400, //KHz
};
#endif

/****************************************
 * Device: ioexpander reset ctrl         *
 ****************************************/
static const tGPIOPin ioexpanderRstPin[] =
{
    {GPIO_OUT_IOEXP_RST,  IO_PORT_C, IO_BIT_2, GPIO_DIGITAL_OUTPUT,   GPIO_DEFAULT_OUT_LOW,  ODC_DISABLE},  // PC2
};

static const tGPIODevice ioexpanderRstConfig =
{
  .deviceInfo.deviceID = IO_EXPANDER_DEV_ID,
  .deviceInfo.deviceType = GPIO_DEV_TYPE,
  .usedGPIOPinNum =  ArraySize(ioexpanderRstPin),
  .pGPIOPinSet = ioexpanderRstPin
};

/****************************************
 * Device: DSP                          *
 ****************************************/

/****************************************
 * Device: Audio                        *
 ****************************************/
static const tGPIOPin gpioAudioPins[] =
{
    {GPIO_OUT_PCM9211_POWER,    IO_PORT_A,  IO_BIT_1,   GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_LOW,    ODC_DISABLE},  
    {GPIO_OUT_PCM3V3_POWER,     IO_PORT_C,  IO_BIT_6,   GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_LOW,    ODC_DISABLE},  
    {GPIO_OUT_SYSPWR_ON,        IO_PORT_C,  IO_BIT_5,   GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_LOW,    ODC_DISABLE},  
    {GPIO_OUT_AMP_POWER,        IO_PORT_A,  IO_BIT_6,   GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_LOW,    ODC_DISABLE},  
    {GPIO_OUT_1V5_POWER,        IO_PORT_C,  IO_BIT_7,   GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_LOW,    ODC_DISABLE},  
    {GPIO_OUT_1V1_POWER,        IO_PORT_A,  IO_BIT_8,   GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_LOW,    ODC_DISABLE},  
    {GPIO_OUT_1V2_POWER,        IO_PORT_C,  IO_BIT_9,   GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_LOW,    ODC_DISABLE},  
    {GPIO_OUT_WIFI_POWER,       IO_PORT_A,  IO_BIT_11,  GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_LOW,    ODC_DISABLE},  
};

static const tGPIODevice gpioAudioConfig =
{
  .deviceInfo.deviceID    = AUDIO_DEV_ID,
  .deviceInfo.deviceType  = GPIO_DEV_TYPE,
  .usedGPIOPinNum =  ArraySize(gpioAudioPins),
  .pGPIOPinSet = gpioAudioPins
};

/****************************************
 * Device: LED                         *
 ****************************************/
static const tIoExpanderLedMap ioeLedMap[] =
{
    {LED0_RED,      COLOR_COMPONENT_RED,    0,   0},
    {LED1_GREEN,    COLOR_COMPONENT_GREEN,  0,   1},
    {LED2_BLUE,     COLOR_COMPONENT_BLUE,   0,   2},
    {LED3_RED,      COLOR_COMPONENT_RED,    0,   3},
    {LED4_GREEN,    COLOR_COMPONENT_GREEN,  0,   4},
    {LED5_BLUE,     COLOR_COMPONENT_BLUE,   0,   5},
};

static const tI2CDevice  Ledi2cDeviceConf =
{
    .deviceInfo.deviceID= LED_DEV_ID,
    .i2cMode            = I2C_MASTER_MODE,
    .channel            = I2C_CHANNEL_ONE,  // I2C1
    .pvSlaveCallback    = NULL,
    .regAddrLen         = REG_LEN_8BITS,
    .baudRate           = 400,      //KHz
    .devAddress         = 0xB6,
};

static const tIoeLedDevice ledConfig = {
    .deviceInfo.deviceID    = LED_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .ledNum                 = ArraySize(ioeLedMap),
    .pIoExpanderLedMap      = ioeLedMap,
    .i2cDeviceConf = &Ledi2cDeviceConf,
};

/****************************************
 * Device: Debug                        *
 ****************************************/
#ifdef HAS_DEBUG
static const tUARTDevice uartDebugConfig = {
    .deviceInfo.deviceID    = DEBUG_DEV_ID,
    .deviceInfo.deviceType  = UART_DEV_TYPE,
    .baudrate   = 115200,
    .uartId     = TP_UART_DEV_2, //PA2, PA3
    .byteSize   = TP_UART_BYTE_SIZE_8_BITS,
    .parity     = TP_UART_PARITY_NONE,
    .stopBits   = TP_UART_STOP_BIT_1,
    .dmaEnable  = FALSE,
    .interrupt.priority    = 0,
    .interrupt.subPriority = 0,     // not-used, for compatibility with PIC32
};
#endif

/****************************************
 * Device: CODEC PCM9211                *
 ****************************************/
#ifdef HAS_PCM9211_CODEC
// PB4
#define PCM_RESET_GPIO_CLOCK        RCC_AHBPeriph_GPIOB
#define PCM_RESET_GPIO_GROUP        GPIOB
#define PCM_RESET_GPIO_PIN          GPIO_Pin_4
void Pcm9211_ResetSetup(int high)
{
    if( high )
        GPIO_SetBits(PCM_RESET_GPIO_GROUP, PCM_RESET_GPIO_PIN);
    else
        GPIO_ResetBits(PCM_RESET_GPIO_GROUP, PCM_RESET_GPIO_PIN);
}

/* config the reset GPIO pin */
void Pcm9211_ResetGPIOInit(void)
{
    GPIO_InitTypeDef  GPIO_InitStructure;

    // enable GPIO clock
    RCC_AHBPeriphClockCmd(PCM_RESET_GPIO_CLOCK, ENABLE);

    GPIO_InitStructure.GPIO_Pin = PCM_RESET_GPIO_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
//    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_Init(PCM_RESET_GPIO_GROUP, &GPIO_InitStructure);
}

static const tI2CDevice  pcm9211I2cDevice =
{
    .i2cMode            = I2C_MASTER_MODE,
    .channel            = I2C_CHANNEL_ONE,
    .pvSlaveCallback    = NULL,
    .regAddrLen      = REG_LEN_8BITS,
    .baudRate           = 400,      //KHz
    .devAddress         = 0x84,
};

