Edmond-Sung-Tymphany/Hendrix_M_Lite_GD/sw/project_files/Atmos_SZ/stm32/attachedDevices.c
static const stPcm9211Device_t pcm9211Config =
{
    .deviceInfo.deviceID    = PCM9211_DEV_ID,
    .deviceInfo.deviceType  = I2C_DEV_TYPE,
    .p_I2cDevice = &pcm9211I2cDevice,
};
#endif  // HAS_PCM9211_CODEC

/****************************************
 * Device: NVM                          *
 ****************************************/
const tStorageDevice nvmConfig = {
    .deviceInfo.deviceID    = INT_FLASH_DEV_ID,
    .deviceInfo.deviceType  = NVM_DEV_TYPE,
};

/****************************************
 * Device: SPI                          *
 ****************************************/
#ifdef HAS_HW_SPI_DEVICE
static const tSpiDevice spi2DspConfig = {
    .deviceInfo.deviceID    = SPI2_DEV_ID,
    .deviceInfo.deviceType  = SPI_DEV_TYPE,
    .channel = TP_SPI_CH_2,
    .spiConfig.SPI_Direction = SPI_Direction_2Lines_FullDuplex,
    .spiConfig.SPI_Mode = SPI_Mode_Master,
    .spiConfig.SPI_DataSize = SPI_DataSize_8b,
    .spiConfig.SPI_CPOL = SPI_CPOL_High,
    .spiConfig.SPI_CPHA = SPI_CPHA_1Edge,
    .spiConfig.SPI_NSS = SPI_NSS_Hard,
    .spiConfig.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2,
    .spiConfig.SPI_FirstBit = SPI_FirstBit_MSB,
    .spiConfig.SPI_CRCPolynomial = 7,
};
#endif	// HAS_HW_SPI_DEVICE

/****************************************
 * Device: software i2c                 *
 ****************************************/
#ifdef HAS_SWi2c_DEVICE

#ifdef EXTERNAL_HIGH_SPEED_CLOCK
// when cpu clock = 32MHz, delay=6, i2c speed ~= 100KHz
// when cpu clock = 32MHz, delay=12, i2c speed ~= 66KHz
// when cpu clock = 32MHz, delay=19, i2c speed ~= 50KHz
void vSWi2c_SclDelay_Normal(void)
{
    uint32_t delay = 6;
    while(delay--)
    {
        asm("nop");asm("nop");
        asm("nop");asm("nop");
    }
}

void vSWi2c_SclDelay_Slow(void)
{
    uint32_t delay = 19;
    while(delay--)
    {
        asm("nop");asm("nop");
        asm("nop");asm("nop");
    }
}

// when cpuclk = 32MHz, 3 nop ~= 200KHz
void vSWi2c_SclDelay_Fast(void)
{
    asm("nop");
    asm("nop");
    asm("nop");
}
#else
// cpu=8MHz, use the short delay
void vSWi2c_SclDelay_Normal(void)
{
    asm("nop");asm("nop");
}
#endif

// ATMOS board : PA4:SCL, PA5:SDA
void SWi2c1_LowLevel_init(void)
{
    GPIO_InitTypeDef  GPIO_InitStructure;

    // enable GPIO clock
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
//    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
}

static void vSWi2c1_SCLSet(int high)
{
    if( high )
        GPIO_SetBits(GPIOA, GPIO_Pin_4);
    else
        GPIO_ResetBits(GPIOA, GPIO_Pin_4);
}

static void vSWi2c1_SDASet(int high)
{
    if( high )
        GPIO_SetBits(GPIOA, GPIO_Pin_5);
    else
        GPIO_ResetBits(GPIOA, GPIO_Pin_5);
}

static void vSWi2c1_SDADirSetup(int dir)
{
    uint32_t pinpos;
    
    // only change the MODER
    pinpos = GPIO_PinSource5;
    GPIOA->MODER  &= ~(GPIO_MODER_MODER0 << (pinpos * 2));
    if( dir )
        GPIOA->MODER |= (GPIO_Mode_OUT << (pinpos * 2));
    else
        GPIOA->MODER |= (GPIO_Mode_IN << (pinpos * 2));
}

static int iSWi2c1_SDASense(void)
{
    int ret_value;

    ret_value = (int)GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_5);

    return ret_value;
}

// ATMOS board : PC15:SCL, PC14:SDA
void SWi2c2_LowLevel_init(void)
{
    GPIO_InitTypeDef  GPIO_InitStructure;

    // enable GPIO clock
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14 | GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
//    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_Init(GPIOC, &GPIO_InitStructure);
}

static void vSWi2c2_SCLSet(int high)
{
    if( high )
        GPIO_SetBits(GPIOC, GPIO_Pin_15);
    else
        GPIO_ResetBits(GPIOC, GPIO_Pin_15);
}

static void vSWi2c2_SDASet(int high)
{
    if( high )
        GPIO_SetBits(GPIOC, GPIO_Pin_14);
    else
        GPIO_ResetBits(GPIOC, GPIO_Pin_14);
}

static void vSWi2c2_SDADirSetup(int dir)
{
    uint32_t pinpos;
    
    // only change the MODER
    pinpos = GPIO_PinSource14;
    GPIOC->MODER  &= ~(GPIO_MODER_MODER0 << (pinpos * 2));
    if( dir )
        GPIOC->MODER |= (GPIO_Mode_OUT << (pinpos * 2));
    else
        GPIOC->MODER |= (GPIO_Mode_IN << (pinpos * 2));
}

static int iSWi2c2_SDASense(void)
{
    int ret_value;

    ret_value = (int)GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_14);

    return ret_value;
}

#ifdef HAS_SSM3582_AMP
static const stSWi2cDevice_t swi2c_SSM3582_W_L_Config = {
    .deviceInfo.deviceID    = SSM3582_W_L_DEV_ID,
    .deviceInfo.deviceType  = SWI2C_DEV_TYPE,
    .busID = eSWi2cBus_ID1,
    .swi2cSpeed = eSWi2c_SPEED_NORMAL,
    .devAddress = 0x2a,
    .delayMSAfterWrite = 0,
    .vSWi2cSCL_Set = vSWi2c1_SCLSet,
    .vSWi2cSDA_Set = vSWi2c1_SDASet,
    .vSWi2cSDA_DirSetup = vSWi2c1_SDADirSetup,
    .iSWi2cSDA_Sense = iSWi2c1_SDASense,
    .vSWi2cSCL_Delay = vSWi2c_SclDelay_Normal,
};

static const stSWi2cDevice_t swi2c_SSM3582_T_L_LU_Config = {
    .deviceInfo.deviceID    = SSM3582_T_L_LU_DEV_ID,
    .deviceInfo.deviceType  = SWI2C_DEV_TYPE,
    .busID = eSWi2cBus_ID1,
    .swi2cSpeed = eSWi2c_SPEED_NORMAL,
    .devAddress = 0x20,
    .delayMSAfterWrite = 0,
    .vSWi2cSCL_Set = vSWi2c1_SCLSet,
    .vSWi2cSDA_Set = vSWi2c1_SDASet,
    .vSWi2cSDA_DirSetup = vSWi2c1_SDADirSetup,
    .iSWi2cSDA_Sense = iSWi2c1_SDASense,
    .vSWi2cSCL_Delay = vSWi2c_SclDelay_Normal,
};

static const stSWi2cDevice_t swi2c_SSM3582_T_C_Config = {
    .deviceInfo.deviceID    = SSM3582_T_C_DEV_ID,
    .deviceInfo.deviceType  = SWI2C_DEV_TYPE,
    .busID = eSWi2cBus_ID1,
    .swi2cSpeed = eSWi2c_SPEED_NORMAL,
    .devAddress = 0x28,
    .delayMSAfterWrite = 0,
    .vSWi2cSCL_Set = vSWi2c1_SCLSet,
    .vSWi2cSDA_Set = vSWi2c1_SDASet,
    .vSWi2cSDA_DirSetup = vSWi2c1_SDADirSetup,
    .iSWi2cSDA_Sense = iSWi2c1_SDASense,
    .vSWi2cSCL_Delay = vSWi2c_SclDelay_Normal,
};

static const stSWi2cDevice_t swi2c_SSM3582_W_C_Config = {
    .deviceInfo.deviceID    = SSM3582_W_C_DEV_ID,
    .deviceInfo.deviceType  = SWI2C_DEV_TYPE,
    .busID = eSWi2cBus_ID1,
    .swi2cSpeed = eSWi2c_SPEED_NORMAL,
    .devAddress = 0x2c,
    .delayMSAfterWrite = 0,
    .vSWi2cSCL_Set = vSWi2c1_SCLSet,
    .vSWi2cSDA_Set = vSWi2c1_SDASet,
    .vSWi2cSDA_DirSetup = vSWi2c1_SDADirSetup,
    .iSWi2cSDA_Sense = iSWi2c1_SDASense,
    .vSWi2cSCL_Delay = vSWi2c_SclDelay_Normal,
};

static const stSWi2cDevice_t swi2c_SSM3582_T_R_RU_Config = {
    .deviceInfo.deviceID    = SSM3582_T_R_RU_DEV_ID,
    .deviceInfo.deviceType  = SWI2C_DEV_TYPE,
    .busID = eSWi2cBus_ID1,
    .swi2cSpeed = eSWi2c_SPEED_NORMAL,
    .devAddress = 0x22,
    .delayMSAfterWrite = 0,
    .vSWi2cSCL_Set = vSWi2c1_SCLSet,
    .vSWi2cSDA_Set = vSWi2c1_SDASet,
    .vSWi2cSDA_DirSetup = vSWi2c1_SDADirSetup,
    .iSWi2cSDA_Sense = iSWi2c1_SDASense,
    .vSWi2cSCL_Delay = vSWi2c_SclDelay_Normal,
};

